package com.timgapps.project3.dto;


// класс DTO (Data Transfer Object)
// специальный класс, который будет служить для общения с клиентом

import javax.persistence.Id;
import java.time.LocalDateTime;

public class MeasurementDTO {

    // здесь будем описывать те поля, которые будут приходить от клиента, и которые мы будем клиенту отправлять
    // добавим аннотации для проверки соответствия полей модели данным из запроса приходящего от клиента
    // DTO вообще никак не связан с базой данных, не помечен аннотацией @Entity, не помечен аннотацией @Table
    // и нет аннотации @Column
    // нет поля id, оно не приходит от клиента, ему его знать не нужно
    // id назначается сервером

    // DTO используется на уровне контроллера и мы не должны глубже заходить с DTO

    private boolean isRaining;

    private double value;



}
