package com.timgapps.project3.dto;

// класс DTO (Data Transfer Object)
// специальный класс, который будет служить для общения с клиентом
public class SensorDTO {
    // Здесь будем описывать те поля, которые будут приходить от клиента, и которые мы будем клиенту отправлять
    // Добавим аннотации для проверки соответствия полей модели данным из запроса приходящего от клиента
    // DTO вообще никак не связан с базой данных, не помечен аннотацией @Entity, не помечен аннотацией @Table
    // и нет аннотации @Column
    // нет поля id, это поле не приходит от клиента, и клиенту в принципе его знать не надо
    // id назначается только на сервере

    // DTO используется на уровне контроллера и мы не должны глубже заходить с DTO



}
